In [1]:
import pandas as pd
pd.__version__

'2.2.3'

In [3]:
data = ["시가", "고가"]
s = pd.Series(data)
s

0    시가
1    고가
dtype: object

In [5]:
data = [80000, "90000"]
s = pd.Series(data)
s

0    80000
1    90000
dtype: object

In [8]:
data = [1000, 2000, 3000]
s = pd.Series(data)
print(s.index, type(s.index))

RangeIndex(start=0, stop=3, step=1) <class 'pandas.core.indexes.range.RangeIndex'>

In [9]:
list(s.index)

[0, 1, 2]

In [10]:
s.index.to_list()

[0, 1, 2]

In [14]:
# help(s.index) # 클래스에는 항상 속성과 메서드 존재

In [29]:
# 시리즈 생성하면서 인덱스도 같이 생성
data = [1000, 2000, 3000]
index = ["A", "B", "C"]

s1 = pd.Series(data, index)
s1

A    1000
B    2000
C    3000
dtype: int64

In [30]:
s.values, type(s.values)

(array([1000, 2000, 3000]), numpy.ndarray)

# 시리즈 인덱싱

In [33]:
print(s1.iloc[2])

3000

In [34]:
print(s1.loc["B"])

2000

In [36]:
# 시리즈 생성하면서 인덱스도 같이 생성
data = [1000, 2000, 3000]
# index가 없음
s2 = pd.Series(data)
print

0    1000
1    2000
2    3000
dtype: int64

In [39]:
print(s2.iloc[0]) # iloc에서의 0은 위치 0을 의미
print(s2.loc[0]) # loc에서의 0은 라벨 0을 의미

1000
1000

In [40]:
s1

A    1000
B    2000
C    3000
dtype: int64

In [41]:
s2

0    1000
1    2000
2    3000
dtype: int64

In [47]:
s1.iloc[0:2]

A    1000
B    2000
dtype: int64

In [48]:
s1.loc["A":"B"]

A    1000
B    2000
dtype: int64

In [49]:
s1["B"] = 500
s1

A    1000
B     500
C    3000
dtype: int64

In [52]:
s1.iloc[0] = 500
s

0     500
1    2000
2    3000
dtype: int64

# 시리즈 연산

In [56]:
date = ["6/1", "6/2", "6/3", "6/4", "6/5"]
high = pd.Series([42800, 42700, 42050, 42950, 43000], index=date)
low = pd.Series([42150, 42150, 41300, 42150, 42350] , index=date)

diff = high - low
print(diff)

6/1    650
6/2    550
6/3    750
6/4    800
6/5    650
dtype: int64

In [59]:
diff.idxmax(), diff[diff.idxmax()]

('6/4', np.int64(800))

In [62]:
diff.idxmin(), diff[diff.idxmin()]

('6/2', np.int64(550))

## 시리즈아 Map

In [63]:
text = '1,234'
text.replace(',','')

'1234'

In [64]:
int(text.replace(',',''))

1234

In [67]:
num_str = ['1,234', '5,678', '12,345']
results = []
for num in num_str:
    temp = int(num.replace(',',''))
    results.append(temp)

results

[1234, 5678, 12345]

In [68]:
def rm_comma(x):
    return int(x.replace(',',''))

In [69]:
s = pd.Series(['1,234', '5,678', '12,345'])
result = s.map(rm_comma)
result

0     1234
1     5678
2    12345
dtype: int64

### 문제
- 기준점이 13이상
-  + 크다 or 작다

In [76]:
s = pd.Series([5, 10, 15, 20])

def measure(x):
    if x>=13:
        return "크다"
    else:
        return "작다"

s.map(measure)

0    작다
1    작다
2    크다
3    크다
dtype: object

In [72]:
def is_greater_13(x): 

    return_text = None
    if x >= 13:
        return "크다"
    else:
        return "작다" 

s = pd.Series([10, 15, 7, 20, 13])
s.map(is_greater_13)

0    작다
1    크다
2    작다
3    크다
4    크다
dtype: object

In [73]:
result = s.map(lambda x: '크다' if x >=13 else '작다')
print(result)

0    작다
1    크다
2    작다
3    크다
4    크다
dtype: object

In [74]:
result = s.apply(lambda x: '크다' if x >=13 else '작다')
print(result)

0    작다
1    크다
2    작다
3    크다
4    크다
dtype: object

## 필터링

In [79]:
data = [42500, 42550, 41800, 42550, 42650]
index = ['2019-05-31', '2019-05-30', '2019-05-29', '2019-05-28', '2019-05-27']
s = pd.Series(data=data, index=index)
s

2019-05-31    42500
2019-05-30    42550
2019-05-29    41800
2019-05-28    42550
2019-05-27    42650
dtype: int64

In [80]:
cond = s > 42000
print(cond)

2019-05-31     True
2019-05-30     True
2019-05-29    False
2019-05-28     True
2019-05-27     True
dtype: bool

In [81]:
s[cond]

2019-05-31    42500
2019-05-30    42550
2019-05-28    42550
2019-05-27    42650
dtype: int64

In [92]:
close = [42500, 42550, 41800, 42550, 42650]
open = [42600, 42200, 41850, 42550, 42500]
index = ['2019-05-31', '2019-05-30', '2019-05-29', '2019-05-28', '2019-05-27']

open = pd.Series(data=open, index=index)
close = pd.Series(data=close, index=index)

open, close

(2019-05-31    42600
 2019-05-30    42200
 2019-05-29    41850
 2019-05-28    42550
 2019-05-27    42500
 dtype: int64,
 2019-05-31    42500
 2019-05-30    42550
 2019-05-29    41800
 2019-05-28    42550
 2019-05-27    42650
 dtype: int64)

In [94]:
close[close > open]

2019-05-30    42550
2019-05-27    42650
dtype: int64

## 데이터프레임 생성

In [50]:
import numpy as np
import pandas as pd

print(np.__version__)
print(pd.__version__)

2.1.1
2.2.3

- 첫번째 방법 : 리스트 활용
- 두번째 방법 : 딕셔너리 활용 (강사 선호)

In [55]:
data = [
    ["003230", "A", 100000, 10.05],
    ["004432", "B", 90000, 1.05],
    ["004050", "C", 110000, 1.25],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data = data, columns = columns)
df

     종목코드 종목명     현재가    등락률
0  003230   A  100000  10.05
1  004432   B   90000   1.05
2  004050   C  110000   1.25

In [58]:
data2 = {
    "종목코드" : ["003230", "004432", "004050"],
    "종목명" : ["A", "B", "C"],
    "현재가" : [100000, 90000, 110000],
    "등락률" : [10.05, 1.05, 1.25]
}
df2 = pd.DataFrame(data = data2)
df2

     종목코드 종목명     현재가    등락률
0  003230   A  100000  10.05
1  004432   B   90000   1.05
2  004050   C  110000   1.25

In [58]:
data2 = {
    "종목코드" : ["003230", "004432", "004050"],
    "종목명" : ["A", "B", "C"],
    "현재가" : [100000, 90000, 110000],
    "등락률" : [10.05, 1.05, 1.25]
}
df2 = pd.DataFrame(data = data2)
df2

     종목코드 종목명     현재가    등락률
0  003230   A  100000  10.05
1  004432   B   90000   1.05
2  004050   C  110000   1.25

In [58]:
data2 = {
    "종목코드" : ["003230", "004432", "004050"],
    "종목명" : ["A", "B", "C"],
    "현재가" : [100000, 90000, 110000],
    "등락률" : [10.05, 1.05, 1.25]
}
df2 = pd.DataFrame(data = data2)
df2

     종목코드 종목명     현재가    등락률
0  003230   A  100000  10.05
1  004432   B   90000   1.05
2  004050   C  110000   1.25

In [18]:
import pandas as pd
import random
import string


# Regenerating the dictionary where each key (종목코드, 종목명, 현재가, 등락률) has a list of values

data_dict = {
    "종목코드": [],
    "종목명": [],
    "현재가": [],
    "등락률": []
}

# Function to generate simpler 종목코드 and 종목명 ensuring the 종목코드 starts with '0'
def generate_code_name_for_dict(existing_codes):
    while True:
        code = '0' + ''.join(random.choices(string.digits, k=5))  # Ensure it starts with '0'
        name = ''.join(random.choices(string.ascii_uppercase, k=2))  # Simpler 종목명 with 2 letters
        if code not in existing_codes:
            return code, name

# Generating 10,000 rows of data
existing_codes_for_dict = set()

for _ in range(10000):
    code, name = generate_code_name_for_dict(existing_codes_for_dict)
    existing_codes_for_dict.add(code)
    current_price = random.randint(1000, 1000000)  # Simpler current price
    change_rate = round(random.uniform(-5, 5), 2)  # Simpler change rate
    
    data_dict["종목코드"].append(code)
    data_dict["종목명"].append(name)
    data_dict["현재가"].append(current_price)
    data_dict["등락률"].append(change_rate)

# Previewing a portion of the dictionary
data_dict_preview = {k: data_dict[k][:5] for k in data_dict}

df2 = pd.DataFrame(data_dict_preview)
df2

     종목코드 종목명     현재가   등락률
0  025588  CZ  255746 -2.51
1  086297  BQ  599996  0.79
2  003954  VB  828913 -1.68
3  019984  OY  827265  2.54
4  010894  QW  252108 -0.04

In [19]:
df2.tail(1)

     종목코드 종목명     현재가   등락률
4  010894  QW  252108 -0.04

In [20]:
df2.head(1)

     종목코드 종목명     현재가   등락률
0  025588  CZ  255746 -2.51

In [21]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   종목코드    5 non-null      object
 1   종목명     5 non-null      object
 2   현재가     5 non-null      int64
 3   등락률     5 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [22]:
df2.describe()

                 현재가       등락률
count       5.000000  5.000000
mean   552805.600000 -0.180000
std    288293.966739  2.002361
min    252108.000000 -2.510000
25%    255746.000000 -1.680000
50%    599996.000000 -0.040000
75%    827265.000000  0.790000
max    828913.000000  2.540000

In [27]:
data2 = {
    "종목코드" : ['039900', '039910', '039920'], 
    "종목명" : ["알파코", "A", "B"], 
    "현재가" : [10000000, 500000, 1000], 
    "등락률" : [10.05, 1.05, 1.28]
}

df2 = pd.DataFrame(data = data2)
df2

     종목코드  종목명       현재가    등락률
0  039900  알파코  10000000  10.05
1  039910    A    500000   1.05
2  039920    B      1000   1.28

In [28]:
df2 = df2.set_index("종목코드")
df2

        종목명       현재가    등락률
종목코드
039900  알파코  10000000  10.05
039910    A    500000   1.05
039920    B      1000   1.28

In [33]:
df2.reset_index() #dfe.reset_index(drop = True)

     종목코드  종목명       현재가    등락률
0  039900  알파코  10000000  10.05
1  039910    A    500000   1.05
2  039920    B      1000   1.28

In [34]:
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05], 
    ["A", 500000, 1.05], 
    ["B", 1000, 1.28]
]

index = ["039900", "039910", "039900"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

        종목명       현재가    등락률
039900  알파코  10000000  10.05
039910    A    500000   1.05
039900    B      1000   1.28

In [38]:
df. values # df.values.shape

array([['알파코', 10000000, 10.05],
       ['A', 500000, 1.05],
       ['B', 1000, 1.28]], dtype=object)

In [39]:
df.현재가

039900    10000000
039910      500000
039900        1000
Name: 현재가, dtype: int64

In [40]:
df['현재가']

039900    10000000
039910      500000
039900        1000
Name: 현재가, dtype: int64

In [43]:
df[['현재가']] #클래스가 다름 -> 속성과 메서드가 다름. 위는 series, 밑에는 dataframe 형태

             현재가
039900  10000000
039910    500000
039900      1000

## 로우 인덱싱
- loc, iloc
- + loc : Label를 기준으로 인덱싱
  + iloc : index를 기준으로 인덱싱

In [46]:
import seaborn as sns

sns.__version__

'0.13.2'

In [48]:
iris = sns.load_dataset("iris")
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [52]:
iris.loc[[0,9], ["sepal_width", "species"]]

   sepal_width species
0          3.5  setosa
9          3.1  setosa

In [54]:
iris.iloc[[0,9], [1, 4]] # 따라서 loc를 써야함

   sepal_width species
0          3.5  setosa
9          3.1  setosa

In [65]:
# 일종의 조건식
# 값을 가져오고 싶다면, True값만 가져옴
iris['sepal_width'] > 4.0
result = iris.loc[iris['sepal_width'] > 4.0, :].reset_index(drop = True)
result

   sepal_length  sepal_width  petal_length  petal_width species
0           5.7          4.4           1.5          0.4  setosa
1           5.2          4.1           1.5          0.1  setosa
2           5.5          4.2           1.4          0.2  setosa

In [67]:
result = iris.loc[iris['sepal_width'] >= 4.0, ["species"]].reset_index(drop = True)
result

  species
0  setosa
1  setosa
2  setosa
3  setosa

In [72]:
# 문자열 기반으로 조회
result = iris.loc[iris['species'] == 'setosa', :].reset_index(drop = True) # 마지막에 .head(1)를 입력하며 데이터 확인
result

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
1            4.9          3.0           1.4          0.2  setosa
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
6            4.6          3.4           1.4          0.3  setosa
7            5.0          3.4           1.5          0.2  setosa
8            4.4          2.9           1.4          0.2  setosa
9            4.9          3.1           1.5          0.1  setosa
10           5.4          3.7           1.5          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa
20           5.4          3.4           1.7          0.2  setosa
21           5.1          3.7           1.5          0.4  setosa
22           4.6          3.6           1.0          0.2  setosa
23           5.1          3.3           1.7          0.5  setosa
24           4.8          3.4           1.9          0.2  setosa
25           5.0          3.0           1.6          0.2  setosa
26           5.0          3.4           1.6          0.4  setosa
27           5.2          3.5           1.5          0.2  setosa
28           5.2          3.4           1.4          0.2  setosa
29           4.7          3.2           1.6          0.2  setosa
30           4.8          3.1           1.6          0.2  setosa
31           5.4          3.4           1.5          0.4  setosa
32           5.2          4.1           1.5          0.1  setosa
33           5.5          4.2           1.4          0.2  setosa
34           4.9          3.1           1.5          0.2  setosa
35           5.0          3.2           1.2          0.2  setosa
36           5.5          3.5           1.3          0.2  setosa
37           4.9          3.6           1.4          0.1  setosa
38           4.4          3.0           1.3          0.2  setosa
39           5.1          3.4           1.5          0.2  setosa
40           5.0          3.5           1.3          0.3  setosa
41           4.5          2.3           1.3          0.3  setosa
42           4.4          3.2           1.3          0.2  setosa
43           5.0          3.5           1.6          0.6  setosa
44           5.1          3.8           1.9          0.4  setosa
45           4.8          3.0           1.4          0.3  setosa
46           5.1          3.8           1.6          0.2  setosa
47           4.6          3.2           1.4          0.2  setosa
48           5.3          3.7           1.5          0.2  setosa
49           5.0          3.3           1.4          0.2  setosa

In [80]:
# 다중 조건
# & : AND 연산자
# | : OR 연산자
# iris.loc[(조건식1) & (조건식2), :]
iris.loc[(iris['species'] == "virginica") &
        (iris['sepal_width'] >= 3.2), :].reset_index(drop=True)

    sepal_length  sepal_width  petal_length  petal_width    species
0            6.3          3.3           6.0          2.5  virginica
1            7.2          3.6           6.1          2.5  virginica
2            6.5          3.2           5.1          2.0  virginica
3            6.4          3.2           5.3          2.3  virginica
4            7.7          3.8           6.7          2.2  virginica
5            6.9          3.2           5.7          2.3  virginica
6            6.7          3.3           5.7          2.1  virginica
7            7.2          3.2           6.0          1.8  virginica
8            7.9          3.8           6.4          2.0  virginica
9            6.3          3.4           5.6          2.4  virginica
10           6.8          3.2           5.9          2.3  virginica
11           6.7          3.3           5.7          2.5  virginica
12           6.2          3.4           5.4          2.3  virginica

## 칼럼 추가하기

In [84]:
iris2 = iris.copy()
iris2['newCol'] = 0
iris2['sepals'] = iris2['sepal_length'] + iris2['sepal_width']
iris2

,sepal_length,sepal_width,petal_length,petal_width,species,newCol,sepals
0,5.1,3.5,1.4,0.2,setosa,0,8.6
1,4.9,3.0,1.4,0.2,setosa,0,7.9
2,4.7,3.2,1.3,0.2,setosa,0,7.9
3,4.6,3.1,1.5,0.2,setosa,0,7.7
4,5.0,3.6,1.4,0.2,setosa,0,8.6
...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,0,9.7
146,6.3,2.5,5.0,1.9,virginica,0,8.8
147,6.5,3.0,5.2,2.0,virginica,0,9.5
148,6.2,3.4,5.4,2.3,virginica,0,9.6
149,5.9,3.0,5.1,1.8,virginica,0,8.9

In [85]:
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05], 
    ["A", 500000, 1.05], 
    ["B", 1000, 1.28]
]

index = ["039900", "039910", "039900"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

        종목명       현재가    등락률
039900  알파코  10000000  10.05
039910    A    500000   1.05
039900    B      1000   1.28

In [88]:
# axis = 0, 행을 처리한다.
# axis = 1, 열을 처리한다.

df.drop("039900", axis = 0)

       종목명     현재가   등락률
039910   A  500000  1.05

In [89]:
df.drop("종목명", axis = 1)

             현재가    등락률
039900  10000000  10.05
039910    500000   1.05
039900      1000   1.28

In [91]:
# 칼럼명 변경
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05], 
    ["A", 500000, 1.05], 
    ["B", 1000, 1.28]
]

index = ["039900", "039910", "039900"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df2 = df.rename(columns = {'종목명' : 'code'})
df2

       code       현재가    등락률
039900  알파코  10000000  10.05
039910    A    500000   1.05
039900    B      1000   1.28

In [97]:
data = [
    ["1,000", "1,100", '1,510'],
    ["1,410", "1,420", '1,790'],
    ["850", "900", '1,185'],
]
columns = ["03/02", "03/03", "03/04"]
df = DataFrame(data=data, columns=columns)
df

   03/02  03/03  03/04
0  1,000  1,100  1,510
1  1,410  1,420  1,790
2    850    900  1,185

## 데이터 내보내기

In [17]:
import seaborn as sns
import pandas as pd

# iris 데이터셋 로드
iris = sns.load_dataset('iris')

# CSV 파일로 저장
iris.to_csv("iris_240930.csv", index=False)

# Excel 파일로 저장
iris.to_excel("iris_excel_240930.xlsx", index=False)

## 데이터 불러오기

In [20]:
df = pd.read_csv("test/iris_240930.csv")
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [21]:
excel_df = pd.read_excel("test/iris_excel_240930.xlsx")
excel_df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]